{
    "former usage": [
        [
            "7095",
            "Formerly used as a fungicide for citrus crops. It has a role as an antimicrobial food preservative and an antifungal agrochemical.",
            "former usage"
        ],
        [
            "6468",
            "Formerly used as an anaesthetic agent, it exhibits both hallucinogenic and neurotoxic effects. It has a role as a neurotoxin, a psychotropic drug, an anaesthetic and a NMDA receptor antagonist.",
            "former usage"
        ],
        [
            "86289068",
            "Formerly used as a fungicide. It has a role as an antifungal agrochemical.",
            "former usage"
        ],
        [
            "285666",
            "It was formerly used as a schistosomicide for individual or mass treatement of infection with Schistosoma haematobium and S.",
            "former usage"
        ],
        [
            "68552",
            "A postganglionic adrenergic blocking agent formerly used for the management of hypertension, it has been largely superseded by other drugs less likely to cause orthostatic hypotension (dizzy spells on standing up or stretching). It has a role as an adrenergic antagonist and an antihypertensive agent.",
            "former usage"
        ],
        [
            "25210",
            "It was formerly used as a diuretic, but more potent and less toxic drugs are now available. Its radiolabelled ((197)Hg, (203)Hg) forms were used in diagnostic aids in renal imaging and brain scans. It has a role as a diuretic and a diagnostic agent.",
            "former usage"
        ],
        [
            "5280707",
            "Formerly used as a food preservative, it was withdrawn from the market following suspicions of carcenogenicity.",
            "former usage"
        ]
    ],
    "agent": [
        [
            "4030",
            "It has a role as an antinematodal drug, a tubulin modulator and a microtubule-destabilising agent.",
            "agent"
        ],
        [
            "447715",
            "A semi-synthetic bile acid which acts as a farnesoid X receptor agonist and is used for treatment of primary biliary cholangitis. It has a role as a farnesoid X receptor agonist and a hepatoprotective agent.",
            "agent"
        ],
        [
            "9988405",
            "It has a role as a metabolite, a leukotriene antagonist and an anti-allergic agent.",
            "agent"
        ],
        [
            "147043",
            "It has a role as a human metabolite and a histamine releasing agent.",
            "agent"
        ],
        [
            "146026563",
            "It has a role as a human metabolite and a histamine releasing agent.",
            "agent"
        ],
        [
            "439201",
            "It has a role as a human blood serum metabolite and a vasodilator agent.",
            "agent"
        ],
        [
            "25804",
            "It is a hair growth stimulant used for the treatment of alopecia. It has a role as a muscarinic agonist and a vasodilator agent.",
            "agent"
        ],
        [
            "26964",
            "It has a role as an antiparkinson drug, an EC 4.1.1.28 (aromatic-L-amino-acid decarboxylase) inhibitor and a dopaminergic agent.",
            "agent"
        ],
        [
            "3219",
            "A relatively selective histamine H1 antagonist, it is used as the difumatate salt for allergic rhinitis, urticaria, and pruritic skin disorders, and in eyedrops for the symptomatic relief of allergic conjuntivitis. It has a role as a H1-receptor antagonist, an anti-allergic agent and an antipruritic drug.",
            "agent"
        ],
        [
            "5280373",
            "A phytoestrogen, it has putative benefits in dietary cancer prophylaxis. It has a role as a phytoestrogen, a plant metabolite, an EC 3.5.1.99 (fatty acid amide hydrolase) inhibitor, a tyrosine kinase inhibitor and an antineoplastic agent.",
            "agent"
        ],
        [
            "146026566",
            "It has a role as a human metabolite and a histamine releasing agent.",
            "agent"
        ],
        [
            "39186",
            "A calcium-channel blocker and vasodilator, it is used as the hydrochloride in the management of angina pectoris and hypertension. It has a role as a calcium channel blocker, a vasodilator agent and an antihypertensive agent.",
            "agent"
        ],
        [
            "34359",
            "It has no antiparkinson activity by itself, but is used (commonly as its hydrate) in the management of Parkinson's disease to reduce peripheral adverse effects of levodopa. It has a role as an EC 4.1.1.28 (aromatic-L-amino-acid decarboxylase) inhibitor, an antiparkinson drug and a dopaminergic agent.",
            "agent"
        ],
        [
            "121871",
            "It has a role as an antilipemic drug, an EC 6.4.1.2 (acetyl-CoA carboxylase) inhibitor, an EC 2.3.3.8 (ATP citrate synthase) inhbitor, a G-protein-coupled receptor agonist and a hypoglycemic agent.",
            "agent"
        ],
        [
            "8288",
            "It has a role as an EC 3.1.1.8 (cholinesterase) inhibitor and a neurotransmitter agent.",
            "agent"
        ],
        [
            "66259",
            "A direct-acting sympathomimetic with marked alpha-adrenergic activity, it is a vasoconstrictor that is used to relieve nasal congestion. It has a role as an alpha-adrenergic agonist, a nasal decongestant, a sympathomimetic agent and a vasoconstrictor agent.",
            "agent"
        ]
    ]
}