{
    "How can the molecule be used as a/an local anaesthetic": "Which kind of local anaesthetic is this molecule",
    "How can the molecule be used as a/an antibiotic": "Which kind of antibiotic is this molecule",
    "How can the molecule be used as a/an antifungal drug": "Which kind of antifungal drug is this molecule",
    "What is the right antineoplastic agent information about this molecule?": "How can the molecule be used as antineoplastic agent",
    "How can the molecule be used as a/an pesticide": "Which kind of pesticide is this molecule",
    "How can the molecule be used as a/an agricultural chemical": "Which kind of agricultural chemical is this molecule",
    "How can the molecule be used as a/an antioxidant": "Which kind of antioxidant is this molecule",
    "Which kind of irritant is this molecule?": "Which kind of irritant can this molecule cause?",
    "What is the right information about this molecule's storage?": "What is the right method for this molecule's storage?",
    "Which kind of epitope does this molecule have?: ": "Which kind of epitope is this molecule?",
    "Which kind of major species does this molecule have?": "Which kind of compound does this molecule belong to?",
    "Which kind of prenyl units does this molecule have?": "How many prenyl units does this molecule have?",
    "Which kind of cation does this molecule have?": "Which kind of cation does this molecule contain or belong to?",
    "Which kind of icosanoid anion does this molecule have?": "Which kind of icosanoid anion is this molecule?",
    "Which kind of flavone does this molecule have?": "Which kind of flavone is this molecule?",
    "Which kind of major microspecies does this molecule have?": "Which kind of compound does this molecule belong to?",
    "Which kind of sugar is this molecule?": "Which kind of sugar component does this molecule have?",
    "Which kind of amino sugar is this molecule?": "Which kind of amino sugar component does this molecule have?",
    "This molecule is a/an isopropyl ester of": "Which kind of isopropyl ester is this molecule?",
    "Which kind of anion is this molecule?": "Which kind of anion does this molecule contain or belong to?",
    "Which is right about the position of deoxygenated in this molecule?": "Which is right about the position of deoxygenation in this molecule?",
    "This molecule is a/an stereoisomer of": "Which kind of stereoisomer is this molecule?",
    "Which kind of replaced by does the molecule result from": "Which kind of replacement does this molecule result from?",
    "Which kind of fatty acid type is this molecule?" : "Which kind of fatty acid is this molecule?"
}