[
    [
        "4748",
        "It has a role as a phenothiazine antipsychotic drug, a dopaminergic antagonist and an antiemetic.",
        "What can this molecule be used as?",
        "antiemetic"
    ],
    [
        "656665",
        "It has a role as a serotonergic antagonist, an antiemetic, a nicotinic acetylcholine receptor agonist, a trypanocidal drug, an immunomodulator, a neuroprotective agent, an apoptosis inhibitor and an anti-inflammatory agent.",
        "What can this molecule be used as?",
        "antiemetic"
    ],
    [
        "441281",
        "Dimenhydrinate is used mainly as an antiemetic in the prevention and treatment of motion sickness. It has a role as a H1-receptor antagonist and an antiemetic.",
        "What can this molecule be used as?",
        "antiemetic"
    ],
    [
        "656664",
        "It has a role as an anti-inflammatory agent, an antiemetic, an apoptosis inhibitor, an immunomodulator, a neuroprotective agent, a nicotinic acetylcholine receptor agonist, a serotonergic antagonist and a trypanocidal drug.",
        "What can this molecule be used as?",
        "antiemetic"
    ],
    [
        "2726",
        "It has a role as a phenothiazine antipsychotic drug, an antiemetic, a dopaminergic antagonist, an EC 3.4.21.26 (prolyl oligopeptidase) inhibitor and an anticoronaviral agent.",
        "What can this molecule be used as?",
        "antiemetic"
    ],
    [
        "46878575",
        "A dopamine antagonist, domperidone is used as an antiemetic for the short-term treatment of nausea and vomiting, and to control gastrointestinal effects of dopaminergic drugs given in the management of parkinsonism. The maleate salt is used in tablet preparations, while the free base is used in oral suspensions. It has a role as an antiemetic and a dopaminergic antagonist.",
        "What can this molecule be used as?",
        "antiemetic"
    ],
    [
        "71587824",
        "Used (in the form of the hydrate) for the prevention of delayed nausea and vomiting associated with initial and repeat courses of emetogenic cancer chemotherapy. It has a role as an antiemetic and a neurokinin-1 receptor antagonist.",
        "What can this molecule be used as?",
        "antiemetic"
    ],
    [
        "44558893",
        "It has a role as an antiemetic and a serotonergic antagonist.",
        "What can this molecule be used as?",
        "antiemetic"
    ],
    [
        "5577",
        "It is used to prevent nausea and vomitting in humans. It has a role as an antiemetic.",
        "What can this molecule be used as?",
        "antiemetic"
    ],
    [
        "2099",
        "It has a role as a serotonergic antagonist, an antiemetic and a gastrointestinal drug.",
        "What can this molecule be used as?",
        "antiemetic"
    ],
    [
        "3151",
        "A dopamine antagonist, it is used as an antiemetic for the short-term treatment of nausea and vomiting, and to control gastrointestinal effects of dopaminergic drugs given in the management of parkinsonism. The free base is used in oral suspensions, while the maleate salt is used in tablet preparations. It has a role as an antiemetic and a dopaminergic antagonist.",
        "What can this molecule be used as?",
        "antiemetic"
    ],
    [
        "4926",
        "It has a role as a dopaminergic antagonist, a H1-receptor antagonist, a muscarinic antagonist, a serotonergic antagonist, a phenothiazine antipsychotic drug, an antiemetic and an EC 3.4.21.26 (prolyl oligopeptidase) inhibitor.",
        "What can this molecule be used as?",
        "antiemetic"
    ],
    [
        "135413536",
        "The molecule is a morpholine-based antiemetic, which is or the prevention of acute and delayed nausea and vomiting associated with initial and repeat courses of highly emetogenic cancer chemotherapy.",
        "What can this molecule be used as?",
        "antiemetic"
    ],
    [
        "5284566",
        "A selective 5-HT3 receptor antagonist, it is used (generally as the monohydrochloride salt) to manage nausea and vomiting caused by cancer chemotherapy and radiotherapy, and to prevent and treat postoperative nausea and vomiting. It has a role as a serotonergic antagonist and an antiemetic.",
        "What can this molecule be used as?",
        "antiemetic"
    ],
    [
        "135398745",
        "It has a role as a histamine antagonist, a muscarinic antagonist, a serotonergic antagonist, a dopaminergic antagonist, an antiemetic, a second generation antipsychotic and a serotonin uptake inhibitor.",
        "What can this molecule be used as?",
        "antiemetic"
    ],
    [
        "25137957",
        "It has a role as a dopaminergic antagonist, an antiemetic and a phenothiazine antipsychotic drug.",
        "What can this molecule be used as?",
        "antiemetic"
    ],
    [
        "445639",
        "It has a role as an EC 3.1.1.1 (carboxylesterase) inhibitor, an Escherichia coli metabolite, a plant metabolite, a Daphnia galeata metabolite, a solvent, an antioxidant and a mouse metabolite.",
        "What can this molecule be used as?",
        "solvent"
    ]
]